app/Controllers/Admin.php

SELECT *
FROM `places`
---
    public function dashboard()
    {
        $data['places'] = $this->placesModel->findAll();

SELECT *
FROM `places`
WHERE `places`.`id` = '36'
DELETE FROM `places`
WHERE `id` IN ('36')
---
    public function deletePlace($id)
    {
        $place = $this->placesModel->find($id);

        if ($place === null) {
            // Jika tempat wisata tidak ditemukan, redirect atau tampilkan pesan error
            return redirect()->to('/admindashboard')->with('error', 'Tempat wisata tidak ditemukan.');
        }

        // Hapus tempat wisata dari database
        $this->placesModel->delete($id);