app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'yoh@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
{
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // Cek apakah pengguna dengan email yang diberikan ada dalam database
    $userModel = new UserModel();
    $user = $userModel->where('email', $email)->first();