app/Controllers/User.php

SELECT *
FROM `places`
---
    public function dashboard()
    {
        $data['places'] = $this->placesModel->findAll();